//==============================================================================
//
// ベースオブジェクト [ObjectManager.js]
//
//==============================================================================

(function( window, undefined ){

//------------------------------------------------------------------------------
// コンストラクタ
//------------------------------------------------------------------------------
ObjectManager = function() {
    // 処理するオブジェクトのリスト
    this.objectList = new Array();
    return this;
};

//------------------------------------------------------------------------------
// 更新
//------------------------------------------------------------------------------
ObjectManager.prototype.update = function() {

    // 順番に処理
    for( var objs=this.objectList, i=0,l=objs.length; i<l; i++) {
        objs[ i ].proc();
    }
};

//------------------------------------------------------------------------------
// 後更新
//------------------------------------------------------------------------------
ObjectManager.prototype.postUpdate = function() {

    // Post 処理
    for( var objs=this.objectList, i=0,l=objs.length; i<l; i++) {
        objs[ i ].postproc();
    }

    // 処理リストを空にする
    objs.length = 0;
};
//------------------------------------------------------------------------------
// 処理リストに追加
//------------------------------------------------------------------------------
ObjectManager.prototype.entryObjectList = function( object ) {
    var objectList = this.objectList;
    objectList[ objectList.length ] = object;
};

})( window );
