//==============================================================================
//
//  状態遷移を管理する [StateControl.js]
//
//==============================================================================

(function( window, undefined ) {

//------------------------------------------------------------------------------
//  コンストラクタ
//
//  @param[in] initState 初期状態
//------------------------------------------------------------------------------
StateControl = function( initState ) {
    this.current   = initState; // 現在の状態
    this.initState = initState; // 最初の状態
    this.prev      = initState; // 前の状態
    this.next      = '';    // 次の状態
    this.frame     = 0;     // 現在の状態のフレーム数
    return this;
};

//------------------------------------------------------------------------------
//  状態を遷移する
//
//  @param[in] next 遷移先の状態
//------------------------------------------------------------------------------
StateControl.prototype.change = function( next ) {
    this.next = next;
};

//------------------------------------------------------------------------------
//  状態をすぐに遷移する
//
//  @param[in] next 遷移先の状態
//------------------------------------------------------------------------------
StateControl.prototype.changeImmediately = function ( next ) {
    this.change( next );
    this.update();
};

//------------------------------------------------------------------------------
//  最初の状態に遷移する
//------------------------------------------------------------------------------
StateControl.prototype.changeInitState = function() {
    this.change( this.initState );
};

//------------------------------------------------------------------------------
//  現座の状態を取得する
//
//  @return state 現在の状態名を返す
//------------------------------------------------------------------------------
StateControl.prototype.get = function() {
    return this.current;
};

//------------------------------------------------------------------------------
//  現在の状態に遷移してからのフレーム数を取得する
//
//  @return frame 現在のフレーム数
//------------------------------------------------------------------------------
StateControl.prototype.getFrame = function() {
    return this.frame;
};

//------------------------------------------------------------------------------
//  一番最初のフレームか
//
//  @return bool 状態遷移がおこなわれてから一度も update() されていなければ true を返す
//------------------------------------------------------------------------------
StateControl.prototype.isFirst = function() {
    return this.frame == 0;
};

//------------------------------------------------------------------------------
//  一番最後のフレームか
//
//  @return bool 次の update() で状態が遷移するなら true を返す
//------------------------------------------------------------------------------
StateControl.prototype.isLast = function() {
    return this.next !== '';
};

//------------------------------------------------------------------------------
//  更新
//------------------------------------------------------------------------------
StateControl.prototype.update = function() {

    //  次の状態が設定されている場合
    if( this.next !== '' ) {
        this.prev    = this.current;
        this.current = this.next;
        this.next    = '';
        this.frame   = 0;
    }

    //  次の状態が設定されていない状態
    else {
        this.frame++;
    }
};

})( window );
