//==============================================================================
//
//  状態遷移を管理する [StateControl.js]
//
//==============================================================================

(function( window, undefined ) {

//------------------------------------------------------------------------------
//  コンストラクタ
//
//  @param[in] first 初期状態
//------------------------------------------------------------------------------
StateControl = function( first ) {

    var self = this instanceof StateControl
             ? this
             : Object.prototype( StateControl.prototype );

    self.current = first; // 現在の状態
    self.first   = first; // 最初の状態
    self.prev    = first; // 前の状態
    self.next    = '';    // 次の状態
    self.frame   = 0;     // 現在の状態のフレーム数

    return self;
};

//------------------------------------------------------------------------------
//  状態を遷移する
//
//  @param[in] next 遷移先の状態
//------------------------------------------------------------------------------
StateControl.prototype.change = function( next ) {
    this.next = next;
};

//------------------------------------------------------------------------------
//  最初の状態に遷移する
//------------------------------------------------------------------------------
StateControl.prototype.changeFirst = function() {
    this.change( this.first );
};

//------------------------------------------------------------------------------
//  現座の状態を取得する
//
//  @return state 現在の状態名を返す
//------------------------------------------------------------------------------
StateControl.prototype.get = function() {
    return this.current;
};

//------------------------------------------------------------------------------
//  現在のフレーム数を取得する
//
//  @return frame 現在のフレーム数
//------------------------------------------------------------------------------
StateControl.prototype.getFrame = function() {
    return this.frame;
};

//------------------------------------------------------------------------------
//  一番最初のフレームか
//
//  @return bool 状態遷移がおこなわれてから一度も update() されていなければ true を返す
//------------------------------------------------------------------------------
StateControl.prototype.isFirst = function() {
    return this.frame == 0;
};

//------------------------------------------------------------------------------
//  一番最後のフレームか
//
//  @return bool 次の update() で状態が遷移するなら true を返す
//------------------------------------------------------------------------------
StateControl.prototype.isLast = function() {
    return this.next !== '';
};

//------------------------------------------------------------------------------
//  更新
//------------------------------------------------------------------------------
StateControl.prototype.update = function() {

    //  次の状態が設定されている場合
    if( this.next !== '' ) {
        this.prev    = this.current;
        this.current = this.next;
        this.next    = '';
        this.frame   = 0;
    }

    //  次の状態が設定されていない状態
    else {
        this.frame++;
    }
};

})( window );
